{
    "COMMONS": {
        "TITLE": "Módulo matemático académico de tablas de la verdad",
        "NAME_DEGREE": "Grado en Técnicas de Aplicaciones de Software",
        "AUTHOR": "Efisio Pitzalis Morillas",
        "UNIVERSITY": "La Salle Universidad Ramón Llull",
        "BOOLE": "Boole",
        "PROPOSITION": "Proposición"
    },
    "ERROR": {
        "AFTER_NEGATIVE": "Después de un símbolo negativo solo se puede poner una variable",
        "AFTER_OPERATOR": "Después de un operador solo puede ir una variable o una apertura de paréntesis",
        "AFTER_VARIABLE": "Después de una variable solo puede ir un operador o cierre de paréntesis",
        "AFTER_OPEN_PARENTHESES": "Después de un inicio de paréntesis solo puede ir un símbolo negativo, una apertura de paréntesis o variable",
        "AFTER_CLOSE_PARENTHESES": "Después de un inicio de paréntesis solo puede ir un símbolo negativo, una apertura de paréntesis o variable",
        "GENERAL": "Ha introducido una sentencia incorrecta"
    },
    "HOME": {
        "HERO_TITLE": "¿Qué puede hacer este módulo matemático?",
        "HERO_SUBTITLE": "Permite resultados de tablas de la verdad. En el caso del cálculo de proposiciones nos indicará si es una tautología, contradicción o contingencia, y en el caso del algebra de Boole se calculará el maxterm y minterm."
    },
    "BOOLE": {
        "HERO_TITLE": "Álgebra de boole",
        "P1_TITLE": "Álgebra de boole",
        "P1_CONTENT_1": "Es una rama especial del álgebra que se usa principalmente en electrónica digital para simplificar los circuitos lógicos",
        "P1_CONTENT_2": "La lógica booleana solo permite dos estados del circuito representados por 1 o 0, donde 1 representa el estado verdadero y 0 representa el estado falso",
        "P2_TITLE": "Tabla de la verdad",
        "P2_CONTENT_1": "Son tablas que representan las posibles salidas que puede tener un circuito lógico en función de unos valores de entrada. En la siguiente imagen podemos ver una tabla de la verdad que nos muestra los posibles resultados de la función \"q\" para una entrada \"a\" y \"b\"",
        "P3_TITLE": "Forma canónica",
        "P3_CONTENT_1": "Es una función booleana donde todos sus términos son sumas o productos de todas sus variables de entrada. Con la forma canónica se pueden simplificar circuitos electrónicos. Gracias a la anterior tabla de la verdad, es más sencillo obtener la siguiente forma canónica de una función",
        "P4_TITLE": "Minterm y Maxterm",
        "P4_CONTENT_1": "El <strong>minterm</strong> es la suma de términos de la función y producto de las variables dentro de los diferentes términos. Indica resultado de la función igual a uno (q=1) de forma directa.",
        "P4_CONTENT_2": "El <strong>maxterm</strong> es el producto de términos de la función y suma de las variables dentro de los diferentes términos. Indica resultado de la función igual a cero (q=0) de forma directa."
    },
    "PROPOSITION": {
        "HERO_TITLE": "Cálculo proposicional",
        "P1_TITLE": "Cálculo proposicional",
        "P1_CONTENT_1": "Una proposición es cualquier frase que tenga un valor de verdad definodo, ya sea verdadero o falso. Por ejemplo:",
        "P1_CONTENT_2": "Está lloviendo. A esta proposición podemos llamarle <strong>\"p\"</strong>, y podrá ser verdadera o falsa.",
        "P2_TITLE": "Tabla de la verdad",
        "P2_CONTENT_1": "Son tablas que representan las posibles salidas que puede tener un cálculo proposicional en función de unos valores de entrada. En la siguiente imagen podemos ver una tabla de la verdad que nos muestra los posibles resultados de <strong>p^q</strong>.",
        "P3_TITLE": "Tautología, contradicción y contingencia",
        "P3_CONTENT_1": "La <strong>tautología</strong> tiene lugar cuando todos los resultados de la tabla de la verdad son verdaderos.",
        "P3_CONTENT_2": "La <strong>contradicción</strong> tiene lugar cuando todos los resultados de la tabla de la verdad son falsos.",
        "P3_CONTENT_3": "La <strong>contingencia</strong> tiene lugar cuando en los resultados de tabla de la verdad encontramos valores verdaderos y falsos.",
        "P3_CONTENT_4": "Ejemplo de contingencia:"
    },
    "RESULT": {
        "OTHER_CALCULATION": "Realizar otro cálculo",
        "BOOLE": "Resultado álgebra de boole",
        "PROPOSITION": "Resultado cálculo proposicional"
    },
    "LANGUAGE": {
        "ES": "Español",
        "CA": "Catalán",
        "EN": "Inglés",
        "DE": "Alemán"
    },
    "HEADER": {
        "CALCULATION": "Cálculo",
        "BOOLE": "Álgebra de boole",
        "PROPOSITION": "Cálculo proposicional"
    },
    "FOOTER": {
        "TFG_BY": "TFG desarrollado por",
        "TFG_TO": "para la"
    }
}